{
  "technique_name": "Forced Oscillation Technique (FOT)",
  "aliases": [],
  "category": "medical_diagnostic_technique",
  "one_liner": "FOT measures respiratory impedance using external oscillatory signals during normal breathing.",
  "how_it_works": "The Forced Oscillation Technique employs external pulse vibrations to assess the flow response of the respiratory tract. By analyzing how the respiratory system reacts to these oscillations, it quantifies respiratory impedance, which is broken down into resistance and reactance at various frequencies. This method is particularly useful for monitoring lung function in patients who cannot perform standard spirometry tests.",
  "algorithm": {
    "steps": [
      "1. Set up the Resmon™Pro V3 device for FOT measurements.",
      "2. Instruct the patient to breathe normally while the device emits oscillatory signals.",
      "3. Measure the flow response of the respiratory tract to the oscillations.",
      "4. Calculate Rrs and Xrs from the measured flow and pressure data.",
      "5. Analyze the results to assess the severity of pulmonary fibrosis."
    ],
    "core_equation": "Zrs = Rrs + jXrs",
    "input_format": "Normal breathing data from patients with Hermansky-Pudlak Syndrome.",
    "output_format": "Values of respiratory resistance (Rrs) and reactance (Xrs) at frequencies of 5, 11, and 19 Hz."
  },
  "parameters": [
    {
      "name": "frequency",
      "typical_value": "5 Hz, 11 Hz, 19 Hz",
      "effect": "Changing frequency can affect the sensitivity of the impedance measurements."
    },
    {
      "name": "device",
      "typical_value": "Resmon™Pro V3",
      "effect": "Different devices may yield varying accuracy and reliability."
    }
  ],
  "complexity": {
    "time": "O(n) where n is the number of measurements taken",
    "space": "O(1) for storing impedance values",
    "practical_note": "Real-world performance may vary based on patient cooperation and device calibration."
  },
  "use_when": [
    "Monitoring patients with Hermansky-Pudlak Syndrome for pulmonary fibrosis.",
    "Assessing lung function in patients unable to perform standard spirometry.",
    "Early detection of lung function deterioration in interstitial lung diseases."
  ],
  "avoid_when": [
    "Patients with normal lung function without risk factors for pulmonary fibrosis.",
    "In cases where spirometry can be performed reliably.",
    "When immediate invasive diagnostic procedures are required."
  ],
  "implementation_skeleton": "def forced_oscillation_measurement(patient_data: List[float]) -> Tuple[float, float]:\n    # Step 1: Set up device\n    device = ResmonPro()\n    # Step 2: Instruct patient\n    instruct_patient_to_breathe_normally()\n    # Step 3: Measure flow response\n    flow_response = device.measure_flow()\n    # Step 4: Calculate Rrs and Xrs\n    Rrs, Xrs = calculate_impedance(flow_response)\n    return Rrs, Xrs",
  "common_mistakes": [
    "Not calibrating the device properly before measurements.",
    "Failing to instruct patients clearly, leading to inconsistent breathing patterns.",
    "Overlooking the importance of selecting appropriate frequencies for measurement."
  ],
  "tradeoffs": {
    "strengths": [
      "Non-invasive and easy to perform.",
      "Can detect changes in lung function earlier than standard spirometry.",
      "Useful for patients who cannot perform traditional lung function tests."
    ],
    "weaknesses": [
      "Requires specialized equipment that may not be widely available.",
      "Interpretation of results can be complex.",
      "Less effective in patients with normal lung function."
    ],
    "compared_to": [
      {
        "technique": "Standard Spirometry",
        "verdict": "Use FOT when patients cannot perform spirometry; otherwise, spirometry is preferred."
      }
    ]
  },
  "connects_to": [
    "Spirometry",
    "Lung Function Testing",
    "Pulmonary Rehabilitation",
    "Respiratory Impedance Measurement"
  ],
  "maturity": "proven (widely used in production)"
}