{
  "technique_name": "Transfer Learning, Active Learning, Low-shot Prompting",
  "aliases": [
    "Transfer Learning",
    "Active Learning",
    "Low-shot Learning"
  ],
  "category": "machine_learning_technique",
  "one_liner": "This technique automates the detection of data leakage in machine learning code using limited annotated datasets.",
  "how_it_works": "The technique leverages transfer learning to adapt pre-trained models to new tasks, active learning to iteratively select the most informative samples for labeling, and low-shot prompting to effectively utilize few examples. By training on a dataset of labeled Python code snippets, the models learn to identify various types of data leakage. The approach is particularly useful when annotated data is scarce, allowing for efficient model training and improved detection capabilities.",
  "algorithm": {
    "steps": [
      "1. Collect and annotate a dataset of Python ML code snippets.",
      "2. Identify types of data leakage (overlap, multi-test, preprocessing).",
      "3. Map leakage types to ML pipeline phases.",
      "4. Filter code snippets to include only those associated with potential leakage.",
      "5. Train models using transfer learning, active learning, or low-shot prompting.",
      "6. Evaluate model performance using metrics like F2-score."
    ],
    "core_equation": "output = model.predict(code_snippet)",
    "input_format": "Python code snippets labeled as having data leakage or not.",
    "output_format": "Predictions indicating whether a code snippet contains data leakage."
  },
  "parameters": [
    {
      "name": "learning_rate",
      "typical_value": "0.001",
      "effect": "A lower learning rate may lead to more stable training but slower convergence."
    },
    {
      "name": "number_of_samples",
      "typical_value": "698 (after active learning)",
      "effect": "Reducing the number of samples can speed up training but may affect model accuracy."
    },
    {
      "name": "dataset_size",
      "typical_value": "1,904 samples",
      "effect": "Larger datasets generally improve model performance but require more resources."
    }
  ],
  "complexity": {
    "time": "O(n log n) for active learning selection",
    "space": "O(n) for storing the dataset",
    "practical_note": "The complexity may vary based on the model architecture and the specific implementation."
  },
  "use_when": [
    "You need to automate the detection of data leakage in ML code.",
    "You have limited annotated datasets for training models.",
    "You want to improve the quality of ML code in production."
  ],
  "avoid_when": [
    "You have a large annotated dataset available for training.",
    "You require real-time detection with minimal latency.",
    "You are working in a domain where data leakage is not a concern."
  ],
  "implementation_skeleton": "def detect_data_leakage(code_snippets: List[str]) -> List[bool]:\n    model = load_pretrained_model()\n    predictions = []\n    for snippet in code_snippets:\n        prediction = model.predict(snippet)\n        predictions.append(prediction)\n    return predictions",
  "common_mistakes": [
    "Neglecting to properly annotate the dataset, leading to poor model performance.",
    "Overfitting the model to a small number of examples.",
    "Failing to evaluate the model on a separate validation set."
  ],
  "tradeoffs": {
    "strengths": [
      "Reduces the need for large annotated datasets.",
      "Improves detection capabilities in scenarios with limited data.",
      "Can adapt to new types of data leakage with minimal retraining."
    ],
    "weaknesses": [
      "May not perform well if the initial model is poorly chosen.",
      "Active learning can be resource-intensive.",
      "Low-shot prompting may lead to overfitting if not managed carefully."
    ],
    "compared_to": [
      {
        "technique": "Traditional Supervised Learning",
        "verdict": "Use transfer learning when labeled data is scarce; traditional methods require more data."
      }
    ]
  },
  "connects_to": [
    "Supervised Learning",
    "Semi-supervised Learning",
    "Data Augmentation",
    "Model Fine-tuning"
  ],
  "maturity": "proven (widely used in production)"
}